Tekla Open API Reference for Tekla Structures 2025
PlacingQuarterAttributes Properties
The PlacingQuarterAttributes type exposes the following members.
Properties
Name | Description
BottomLeft
 Defines whether the object can search for a suitable location in the bottom left direction.
BottomRight
 Defines whether the object can search for a suitable location in the bottom right direction.
TopLeft
 Defines whether the object can search for a suitable location in the top left direction.
TopRight
 Defines whether the object can search for a suitable location in the top right direction.
Top
See Also
Reference
PlacingQuarterAttributes Class
Tekla.Structures.Drawing Namespace